# Linguagem SQL
**S**tructured **Q**uery **L**anguage. É uma linguagem de programação usada para gerenciar e manipular bancos de dados relacionais. Com o SQL, os usários podem realizar diversas operações, como consultar, inserir, atualizar e deletar dados. SQL é essencial para interar com SGBDs.
Como MySQL, PostgreeSQL, SQLite, Oracle Database e Microsoft SQL server.

Desenvolvida inicialmente pela IBM nos anos 1970, baseado no modelo proposto por Edgar Codd.

## Características Principais da SQL
**Declaração de Dados (DDL)**: Comandos como 'CREATE','ALTER','DROP', para definir e modificar a estrutura de banco de dados.
**Manipulação de Dados (DML)**: Comandos como 'SELECT','INSERT','UPDATE','DELETE' para manipular dados.
**Controle de Transações (TCL)**: Comandos como 'COMMIT', 'ROLLBACK' para gerenciar transações.
**Controle de Dados (DCL)**: Comandos como 'GRANT', 'REVOKE' para controlar acesso a dados.

# Comandos básicos do SQL

# SELECT
Usado para consultar dados de uma tabela

In [ ]:
SELECT nome, idade FROM ListaDeEstudantes;

# INSERT
Usado para inserir novos dados em uma tabela.

In [ ]:
INSERT INTO ListaDeEstudantes (nome, idade) VALUES ('Vinicius', 18);

In [ ]:
INSERT INTO ListaDeEstudantes (nome, idade) VALUES ('Alice', 20

# UPDATE
Usado para atualizar dados em uma tabela

In [ ]:
UPDATE ListaDeEstudantes SET idade = 19 WHERE nome = Vinicius;

# DELETE
Usado para deletar dados de uma tabela

In [ ]:
DELETE FROM ListaDeEstudantes WHERE nome = Alice;

# CREATE TABLE
Usado para criar uma nova tabela no banco de dados.

In [ ]:
CREATE TABLE ListaDeEstudantesAprovados (
    id INTEGER PRIMARY KEY,
    nome TEXT,
    idade INTEGER
);

# DROP TABLE
Usado para deletar uma tabela do banco de dados

In [ ]:
DROP TABLE ListaDeEstudantesAprovados;

# ALTER TABLE
Usado para modificar a estrutura de uma tabela existente.

In [ ]:
ALTER TABLE ListaDeEstudantes ADD COLUMN sobrenome TEXT;

# WHERE
Usado para filtrar registros que atendem a uma condição específica.

In [ ]:
SELECT nome, idade FROM ListaDeEstudantes WHERE idade > 18;

# ORDER BY
Usado para ordenar os resultados

In [ ]:
SELECT nome, idade FROM ListaDeEstudantes ORDER BY idade DESC;

# GROUP BY
Usado para agrupar registros que têm valores iguais em colunas especificas.

In [ ]:
SELECT idade, COUNT(*) FROM ListaDeEstudantesAprovados GROUP BY idade;

# HAVING
Usado para filtrar grupos de registros, semelhante ao WHERE, mas para grupos.

In [ ]:
SELECT idade FROM ListaDeEstudantesAprovados GROUP BY idade HAVING COUNT(*) > 1;

# JOIN
Usado para combinar registros de duas ou mais tabelas baseadas em uma coluna relacionada entre elas.

In [ ]:
SELECT ListaDeEstudantes.nome, ListaDeEstudantes.idade, ListaDeCursos.nome FROM ListaDeEstudantes JOIN ListaDeCursos ON ListaDeEstudantes.curso_id = ListaDeCursos.id;